MPETREMANN11/ESP32forth/__PlatformIO/src/ESP32forth_V_70721c.cpp
    // Polling toutes les 500ms avec verrou anti-chevauchement
    setInterval(function() {
      if (!isPolling) {
        isPolling = true;
        ask('');
      }
    }, 500);

    promptInput.onkeyup = function(event) {
      if (event.keyCode === 13) {
        event.preventDefault();
        ask(promptInput.value + '\n');
        promptInput.value = '';
      }
    };

    filepick.onchange = function(event) {
      if (event.target.files.length > 0) {
        var reader = new FileReader();
        reader.onload = function(e) {
          var parts = e.target.result.replace(/[\r]/g, '').split('\n');
          function upload() {
            if (parts.length === 0) {
              filepick.value = '';
              return;
            }
            ask(parts.shift() + '\n', upload);  // Ajout du \n manquant sur chaque ligne
          }
          upload();
        };
        reader.readAsText(event.target.files[0]);
      }
    };

    window.onload = function() {
      ask('\n');
      promptInput.focus();
    };
  </script>
</body>
</html>
| constant index-html# constant index-html

variable webserver
2000 constant out-size
200 stream input-stream
out-size stream output-stream
create out-string out-size 1+ allot align

: handle-index
   s" text/html" ok-response
   index-html index-html# send
;

: handle-input
   begin body dup >r input-stream >stream pause r> 0= until
   out-string out-size output-stream stream>
   s" text/plain" ok-response
   out-string z>s send
;

: serve-type ( a n -- ) output-stream >stream ;
: serve-key ( -- n ) input-stream stream>ch ;

: handle1
  handleClient if
    s" /" path str= if handle-index exit then
    s" /input" path str= if handle-input exit then
    notfound-response
  then
;

: do-serve    begin handle1 pause again ;
' do-serve 1000 1000 task webserver-task

: server ( port -- )
   server
   ['] serve-key is key
   ['] serve-type is type
   webserver-task start-task
;

only forth definitions
web-interface
~ evaluate ; is web-interface

( Lazy loaded Server Terminal )

:noname [ ' web-interface >body @ ] literal execute
r|
also streams also sockets also WiFi also web-interface

: login ( z z -- )
   WIFI_MODE_STA Wifi.mode
   WiFi.begin begin WiFi.localIP 0= while 100 ms repeat WiFi.localIP ip. cr
   z" forth" MDNS.begin if ." MDNS started" else ." MDNS failed" then cr ;
: webui ( z z -- ) login 80 server ;

only forth definitions
web-interface
| evaluate ; is web-interface
: login web-interface forth r| login | evaluate ;
: webui web-interface forth r| webui | evaluate ;
vocabulary registers   registers definitions

( Tools for working with bit masks )
: m! ( val shift mask a -- )
   dup >r @ over invert and >r >r lshift r> and r> or r> ! ;
: m@ ( shift mask a -- val ) @ and swap rshift ;

only forth definitions
( Lazy loaded Telnet )
: telnetd r|

vocabulary telnetd   telnetd definitions also sockets

-1 value sockfd   -1 value clientfd
sockaddr telnet-port   sockaddr client   variable client-len

defer broker

: telnet-emit ( ch -- ) >r rp@ 1 clientfd write-file rdrop if broker then ;
: telnet-type ( a n -- ) for aft dup c@ telnet-emit 1+ then next drop ;
: telnet-key ( -- n ) 0 >r rp@ 1 clientfd read-file swap 1 <> or if rdrop broker then r> ;

: connection ( n -- )
  dup 0< if drop exit then to clientfd
  0 echo !
  ['] telnet-key is key
  ['] telnet-type is type quit ;

: wait-for-connection
  begin
    sockfd client client-len sockaccept
    dup 0 >= if exit else drop then
  again
;

: broker-connection
  rp0 rp! sp0 sp!
  begin
    ['] default-key is key   ['] default-type is type
    -1 echo !
    ." Listening on port " telnet-port ->port@ . cr
    wait-for-connection
    ." Connected: " dup . cr connection
  again ;
' broker-connection is broker

: server ( port -- )
  telnet-port ->port!
  AF_INET SOCK_STREAM 0 socket to sockfd
  sockfd non-block throw
  sockfd telnet-port sizeof(sockaddr_in) bind throw
  sockfd 1 listen throw   broker ;

only forth definitions
telnetd
| evaluate ;
internals DEFINED? assembler-source [IF]
  assembler-source evaluate
[THEN] forth
internals DEFINED? xtensa-assembler-source [IF]
  xtensa-assembler-source evaluate
[THEN] forth
internals DEFINED? riscv-assembler-source [IF]
  riscv-assembler-source evaluate
[THEN] forth

internals DEFINED? camera-source [IF]
  camera-source evaluate
[THEN] forth

internals DEFINED? interrupts-source [IF]
  interrupts-source evaluate
[THEN] forth

internals DEFINED? oled-source [IF]
  oled-source evaluate
[THEN] forth

internals DEFINED? spi-source [IF]
  spi-source evaluate
[THEN] forth

internals DEFINED? espnow-source [IF]
  espnow-source evaluate
[THEN] forth

DEFINED? rmt-builtins [IF]
  vocabulary rmt   rmt definitions
  transfer rmt-builtins
  forth definitions
[THEN]

internals DEFINED? serial-bluetooth-source [IF]
  serial-bluetooth-source evaluate
[THEN] forth

internals DEFINED? spi-flash-source [IF]
  spi-flash-source evaluate
[THEN] forth

internals DEFINED? HTTPClient-builtins [IF]
  vocabulary HTTPClient   HTTPClient definitions
  transfer HTTPClient-builtins
  forth definitions
[THEN] forth
internals definitions


( Change default block source on arduino )
: arduino-default-use s" /spiffs/blocks.fb" open-blocks ;
' arduino-default-use is default-use

( Setup remember file )
: arduino-remember-filename   s" /spiffs/myforth" ;
' arduino-remember-filename is remember-filename

( Check for autoexec.fs and run if present.
  Failing that, try to revive save image. )
: autoexec
   ( Allow skip start files if key hit within 100 ms )
   10 for key? if rdrop exit then 10 ms next
   s" /spiffs/autoexec.fs" 2dup file-exists?
     if included else 2drop then
   ['] revive catch drop ;
' autoexec ( leave on the stack for fini.fs )

forth definitions
internals
\ dump tool
: dump ( addr len -- )
    cr cr ." --addr---  "
    ." 00 01 02 03 04 05 06 07 08 09 0A 0B 0C 0D 0E 0F  ------chars-----"
    2dup + { END_ADDR }             \ store latest address to dump
    swap { START_ADDR }             \ store START address to dump
    START_ADDR 16 / 16 * { 0START_ADDR } \ calc. addr for loop start
    16 / 1+ { LINES }
    base @ { myBASE }               \ save current base
    hex
    \ outer loop
    LINES 0 do
        0START_ADDR i 16 * +        \ calc start address for current line
        cr <# # # # #  [char] - hold # # # # #> type
        space space     \ and display address
        \ first inner loop, display bytes
        16 0 do
            \ calculate real address
            0START_ADDR j 16 * i + +
            ca@ <# # # #> type space \ display byte in format: NN
        loop 
        space
        \ second inner loop, display chars
        16 0 do
            \ calculate real address
            0START_ADDR j 16 * i + +
            \ display char if code in interval 32-127
            ca@     dup 32 < over 127 > or
            if      drop [char] . emit
            else    emit
            then
        loop 
    loop
    myBASE base !               \ restore current base
    cr cr
  ;

create crlf 13 C, 10 C,
: RECORDFILE  ( "filename" "filecontents" "<EOF>" -- )
    bl parse
    W/O CREATE-FILE throw >R
    BEGIN
        tib #tib accept
        tib over
        S" <EOF>" startswith?
        DUP IF
            swap drop
        ELSE
            swap
            tib swap
            R@ WRITE-FILE throw
            crlf 1+ 1 R@ WRITE-FILE throw
        THEN
    UNTIL
    R> CLOSE-FILE throw
;
: MAIN ( -- )
    s" /spiffs/main.fs"       included
  ;

